OCR_Website/app/Services/LoginServices.php

    public function hasLoginInfo($requestData){
        $validation = $this->validateLogin($requestData);

        if ($validation -> getErrors()) {
            return [
                'status' => ResultUtils::STATUS_CODE_ERR,
                'messageCode' => ResultUtils::MESSAGE_CODE_ERR,
                'message' => $validation->getErrors(),
            ];
        }
        $dataSave = $requestData->getPost();
        $user = $this->users->where('email', $dataSave['email'])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'meh3@gmail.com'
 LIMIT 1